TestEDT/src/Catalogs/НаборПравилКонвертации/НаборПравилКонвертации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборПравилКонвертации</name>
  <tabularSections>
    <name>ПравилаКонвертации</name>
    <attributes>
      <name>ПравилоКонвертацииАналитики</name>
      <type>
        <types>CatalogRef.ПравилаКонвертацииАналитики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

TestEDT/src/Catalogs/ПравилаКонвертацииАналитики/ПравилаКонвертацииАналитики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаКонвертацииАналитики</name>
  <attributes>
    <name>Источник</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоЕПС</types>
    </type>
  </attributes>
  <attributes>
    <name>Приемник</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоЕПС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйАлгоритм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстАлгоритма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

TestEDT/src/Catalogs/НаборПравилКонвертации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьПравилаСОдинаковымиИсточникомИПриемником() Тогда 
		ТекстСообщения = НСтр("ru = 'В табличной части есть правила у которых совпадают Источник и Приемник'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВСПОМОГАТЕЛЬНЫЕ_ПРОЦЕДУРЫ_ФУНКЦИИ

Функция ЕстьПравилаСОдинаковымиИсточникомИПриемником()
	
	МассивПравил = ПравилаКонвертации.ВыгрузитьКолонку("ПравилоКонвертацииАналитики");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаКонвертации.ПравилоКонвертацииАналитики КАК ПравилоКонвертации
	|ПОМЕСТИТЬ ТаблицаПравилКонвертации
	|ИЗ
	|	&ПравилаКонвертации КАК ПравилаКонвертации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПравилаКонвертацииАналитики.Источник,
	|	ПравилаКонвертацииАналитики.Приемник,
	|	СУММА(1) КАК КоличествоОдинаковых
	|ИЗ
	|	ТаблицаПравилКонвертации КАК ТаблицаПравилКонвертации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаКонвертацииАналитики КАК ПравилаКонвертацииАналитики
	|		ПО ТаблицаПравилКонвертации.ПравилоКонвертации = ПравилаКонвертацииАналитики.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПравилаКонвертацииАналитики.Источник,
	|	ПравилаКонвертацииАналитики.Приемник
	|
	|ИМЕЮЩИЕ
	|	СУММА(1) > 1";
	
	Запрос.УстановитьПараметр("ПравилаКонвертации", ПравилаКонвертации);
		
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
